# Database Name : RSQL
# Table Name : score
- id, korean, english, mathematics

- Anaconda Navigator
- rJava,RMySQL 설치

In [92]:
library(RMySQL)

In [93]:
# DB Connection

conn <- dbConnect(MySQL(),
                  dbname = 'moviesTone',
                  user = 'root',
                  password = 'qwer1234',
                  host = '127.0.0.1'
                 )

In [94]:
# 테이블 목록
dbListTables(conn)

 [1] "direct"         "director"       "director_actor" "distributor"
 [5] "genre"          "jo_actor"       "jo_in"          "ju_actor"
 [9] "ju_in"          "movie"          "predict"        "user"
[13] "year_screen"

In [95]:
# 테이블의 컬럼 목록
dbListFields(conn, 'ju_actor')

[1] "ju_actor_id"    "ju_actor_name"  "ju_actor_score"

In [96]:
# Select
dbGetQuery(conn, 'select count(*) from ju_actor')

  count(*)
1 0

In [97]:
dbGetQuery(conn, 'select * from ju_actor')

     ju_actor_id ju_actor_name ju_actor_score

In [98]:
ju <- read.csv("./movies2/actor_score_ver3.csv",stringsAsFactors = F)
jo <- read.csv("./movies2/jo_score_ver2.csv",stringsAsFactors = F)

In [99]:
head(ju,2)

  주연   횟수 점수 평균점수
1 하정우 15   50   3.333333
2 송강호 11   42   3.818182

In [100]:
paste('a',1,'b')

[1] "a 1 b"

In [101]:
for(i in 1:nrow(ju)){
    str1 = paste('insert into ju_actor values (',i,',\'',ju$주연[i],'\',',ju$평균점수[i],')' , sep = '')
    dbSendQuery(conn, str1)
}

In [102]:
for(i in 1:nrow(jo)){
    str1 = paste('insert into jo_actor values (',i,',\'',jo$조연[i],'\',',jo$평균점수[i],')' , sep = '')
    dbSendQuery(conn, str1)
}

In [103]:
diract<-read.csv("./movies/감독_배우_점수.csv",stringsAsFactors = F)

In [104]:
head(diract)

  감독_배우     점수
1 강우석_정재영 0
2 강우석_강신일 1
3 강우석_유해진 2
4 강우석_탁트인 1
5 강우석_이상현 1
6 강우석_김윤성 1

In [105]:
diract$감독 <- ""
diract$배우 <- ""

In [106]:
for(i in 1:nrow(diract)){
    diract$감독[i] <- unlist(strsplit(diract$감독_배우[i],"_"))[1]
    diract$배우[i] <- unlist(strsplit(diract$감독_배우[i],"_"))[2]
}

In [107]:
for(i in 1:nrow(diract)){
    str1 = paste('insert into director_actor values (',i,',\'',diract$배우[i] ,'\',\'',diract$감독[i],'\',', diract$점수[i],')' , sep = '')
    dbSendQuery(conn, str1)
}

In [108]:
df<-read.csv("./movies2/fortest5.csv",stringsAsFactors = F)
df2<- read.csv("./movies2/First_Price.csv",stringsAsFactors = F)

In [109]:
nrow(df2)

[1] 108

In [110]:
library(dplyr)

In [111]:
df2<-arrange(df2, 영화명)

In [112]:
for(i in 1:nrow(df2)){
    str1 = paste('insert into movie (movie_id,movie_name,movie_img) values (',i,',\'',df2$영화명[i] ,'\',\'./movieposter/',df2$영화명[i],'.jpeg\')', sep = '')
    dbSendQuery(conn, str1)
}

In [113]:
library(dplyr)

In [114]:
head(df2,2)

  영화명     누적매출액  누적관객수 스크린수 상영횟수 개봉일
1 1987       58169776145 7232387    1299     138226   2017-12-27
2 7급 공무원 26380710000 4039891     475      90779   2009-04-22
  배급사               등급           장르                    감독   ...
1 CJ ENM               15세이상관람가 드라마                  장준환 ...
2 (주)롯데엔터테인먼트 12세이상관람가 코미디,액션,드라마,범죄 신태라 ...
  배우누적점수 배우점수 감독점수 장르_관객점수부여 휴일 X12세이상관람가
1 62.17949     16       4        10                9    FALSE
2  6.50000      4       3        10                9     TRUE
  X15세이상관람가 전체관람가 청소년관람불가 배급사점수
1  TRUE           FALSE      FALSE          3
2 FALSE           FALSE      FALSE          2

In [115]:
head(ju,2)

  주연   횟수 점수 평균점수
1 하정우 15   50   3.333333
2 송강호 11   42   3.818182

In [116]:
ju2 <- ju

In [117]:
x<- c()

for(i in 1:nrow(ju)){
    for(j in 1:nrow(df2)){
        if(ju$주연[i] %in% unlist(strsplit(df2$주연[j],","))){
            temp <- data.frame(ju_id = i, m_id = j)
            x<-rbind(x,temp)
        }
    }
}

In [122]:
head(x,3)

  ju_id m_id
1 1      1
2 1     19
3 1     21

In [123]:
for(i in 1:nrow(x)){
    str1 = paste('insert into ju_in values (',x$ju_id[i],',',x$m_id[i],')', sep = '')
    dbSendQuery(conn, str1)
}

In [126]:
x<- c()

for(i in 1:nrow(jo)){
    for(j in 1:nrow(df2)){
        if(jo$조연[i] %in% unlist(strsplit(df2$조연[j],","))){
            temp <- data.frame(jo_id = i, m_id = j)
            x<-rbind(x,temp)
        }
    }
}

In [127]:
for(i in 1:nrow(x)){
    str1 = paste('insert into jo_in values (',x$jo_id[i],',',x$m_id[i],')', sep = '')
    dbSendQuery(conn, str1)
}

In [128]:
dir1 <- read.csv("./movie3/director_score_db.csv")

In [130]:
head(dir1,2)

  감독   점수
1 김용화 52
2 최동훈 50

In [131]:
for(i in 1:nrow(dir1)){
    str1 = paste('insert into director values (',i,',\'',dir1$감독[i],'\',',dir1$점수[i],')', sep = '')
    dbSendQuery(conn, str1)
}

In [134]:
dis <- read.csv("./movie3/distributor_score_db.csv",stringsAsFactors = F)

In [136]:
head(dis,6)

  distributor                     점수
1 (주)넥스트엔터테인먼트월드(NEW) 2
2 (주)롯데엔터테인먼트            2
3 (주)쇼박스                      3
4 (주)시네마서비스                1
5 (주)싸이더스                    1
6 (주)에이스메이커무비웍스        1

In [139]:
for(i in 1:nrow(dis)){
    str1 = paste('insert into distributor values (',i,',\'',dis$distributor[i],'\',',dis$점수[i],')', sep = '')
    dbSendQuery(conn, str1)
}

In [140]:
genre <- read.csv("./movie3/genre_score_db.csv",stringsAsFactors = F)

In [141]:
head(genre,2)

  장르       장르점수
1 공포(호러) 10
2 스릴러     10

In [142]:
for(i in 1:nrow(genre)){
    str1 = paste('insert into genre values (',i,',\'',genre$장르[i],'\',',genre$장르점수[i],')', sep = '')
    dbSendQuery(conn, str1)
}

In [143]:
year <- read.csv("./movie3/year_screen_db.csv",stringsAsFactors = F)

In [145]:
head(year,1)

  년도 스크린수
1 2000 1200

In [146]:
for(i in 1:nrow(year)){
    str1 = paste('insert into year_screen values (',year$년도[i],',',year$스크린수[i],')', sep = '')
    dbSendQuery(conn, str1)
}

In [148]:
head(dir1,2)

  감독   점수
1 김용화 52
2 최동훈 50

In [149]:
x<- c()

for(i in 1:nrow(dir1)){
    for(j in 1:nrow(df2)){
        if(dir1$감독[i] %in% unlist(strsplit(df2$감독[j],","))){
            temp <- data.frame(dir_id = i, m_id = j)
            x<-rbind(x,temp)
        }
    }
}

In [154]:
tail(x)

    dir_id m_id
103 74      25
104 75      38
105 76      59
106 77      60
107 78     103
108 79      48

In [153]:
for(i in 1:nrow(x)){
    str1 = paste('insert into direct values (',x$m_id[i],',',x$dir_id[i],')', sep = '')
    dbSendQuery(conn, str1)
}

In [52]:
df5<-read.csv("./movies/movie2004_2019_ver1.csv")

In [56]:
df5[df5$영화명 == "한반도",]

    영화명 개봉일     매출액      매출액점유율 누적매출액  관객수  누적관객수
219 한반도 2006-07-13 20597497600 2            20597497600 3331593 3331593
    스크린수 상영횟수 대표국적 제작사                 배급사 등급       장르
219 483      49539    한국     (주)시네마서비스글로벌 CJ ENM 15세관람가 드라마
    감독   배우
219 강우석 조재현

In [8]:
dbSendQuery(conn, 'insert into ju values (1,100,100,100)')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100

In [9]:
dbSendQuery(conn, 'insert into score values (2,90,90,90)')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     90      90

In [11]:
# Update
dbSendQuery(conn, 'update score set korean = 90, english = 80, mathematics = 70 where id = 2')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     80      70

In [13]:
dbSendQuery(conn, 'delete from score')

result = dbGetQuery(conn, 'select * from score')
result

     id korean english mathematics

In [26]:
# csv file을 읽어서 MySQL에 넣기
data <- read.csv("../Data/score.csv",header=F)
colnames(data) = c("id","korean","english","mathmatics")
data

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [27]:
dbWriteTable(conn, "score", data, overwrite =T, row.names = F) # append=T(overwrite 안쓸시에 추가 넣는 방식)

[1] TRUE

In [28]:
data2 <- read.csv("../Data/score2.csv",header=F)
colnames(data2) = c("id","korean","english","mathmatics")
data2

  id korean english mathmatics
1 11 90     80      70
2 12 90     88      70

In [29]:
dbWriteTable(conn, "score", data2,append =T, row.names = F)

[1] TRUE

In [30]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11 11  90     80      70
12 12  90     88      70

In [31]:
#Disconnect
dbDisconnect(conn)

[1] TRUE